GS/OSet/oset.org
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t c:nil
#+OPTIONS: creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t
#+OPTIONS: num:t p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t timestamp:t
#+OPTIONS: title:t toc:t todo:t |:t
#+TITLES: oset
#+DATE: <2017-10-09 Mon>
#+AUTHORS: weiwu
#+EMAIL: victor.wuv@gmail.com
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 24.5.1 (Org mode 8.3.4)
#+SETUPFILE: ../../configOrg/level2.org

* stock
** 普通股
是指在公司的经营管理和盈利及财产的分配上享有普通权利的股份，代表满足所有债权偿付要求及优先股东的收益权与求偿权要求后对企业盈利和剩余财产的索取权。
** 优先股

优先股在利润分红及剩余财产分配的权利方面优先于普通股。
** 后配股
是在利益或利息分红及剩余财产分配时比普通股处于劣势的股票，一般是在普通股分配之后，对剩余利益进行再分配。
** 垃圾股
经营亏损或违规的公司的股票。
** 绩优股
公司经营很好，业绩很好，每股收益0.8元以上.市盈率10-15倍以内.指那些业绩优良，但增长速度较慢的公司的股票。这类公司有实力抵抗经济衰退，但这类公司并不能给你带来振奋人心的利润。

** 蓝筹股
那些在其所属行业内占有重要支配性地位、业绩优良，成交活跃、红利优厚的大公司股票称为蓝筹股。
** 成长股
是指发行股票时规模并不大，但公司的业务蒸蒸日上，管理良好，利润丰厚，产品在市场上有竞争力的公司的股票。
** 热门股
是指交易量大、交易周转率高、股价涨跌幅度也较大的股票。热门股的形成往往有其特定的经济、政治、社会等原因。
** 周期股
是指经营业绩随着经济周期的涨缩而变动的公司的股票。航空工业、汽车工业、钢铁及化学工业都属于此类。
** 再生股
是指经营发生困难甚至破产，经过整顿后重新获得投资者认可的企业股票。
** 防守性股
这些普通股股票同股价循环股正好相反，它们在面临不确定性和商业衰退时收益和红利却要比社会平均的高，具有相对的稳定性。
** 表现股(亦称概念股)
是指能迎合某一时代潮流但未必能适应另一时代潮流的公司所发行的，股价呈巨幅起伏的股票。
** 投机性股
是指那些价格很不稳定或公司前景很不确定的普通股。这主要是那些雄心很大，开发性或冒险性的公司的股票，热门的新发行股以及一些面值较低的石油与矿业公司发行的普通股票。
* strategy

* doc
** 研究标的为期货
** 研究标的为基金
** 研究标的为股票
** 研究方式为技术面
** 研究方式为基本面
** 研究方式为机器学习和人工智能
** 文档语言为英文
** 文档语言为中文
** 发布类型为研究报告
*** Journal of business strategies
*** the account review
*** The Journal of Finance
*** Quantitative Finance
