docs/GS/OSet/oset.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-10 Tue 15:54 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
<link rel="stylesheet" type="text/css" href="../../styles/demo/css/demo.css"/>
<link href="https://fonts.proxy.ustclug.org/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline14">1. stock</a>
<ul>
<li><a href="#orgheadline1">1.1. 普通股</a></li>
<li><a href="#orgheadline2">1.2. 优先股</a></li>
<li><a href="#orgheadline3">1.3. 后配股</a></li>
<li><a href="#orgheadline4">1.4. 垃圾股</a></li>
<li><a href="#orgheadline5">1.5. 绩优股</a></li>
<li><a href="#orgheadline6">1.6. 蓝筹股</a></li>
<li><a href="#orgheadline7">1.7. 成长股</a></li>
<li><a href="#orgheadline8">1.8. 热门股</a></li>
<li><a href="#orgheadline9">1.9. 周期股</a></li>
<li><a href="#orgheadline10">1.10. 再生股</a></li>
<li><a href="#orgheadline11">1.11. 防守性股</a></li>
<li><a href="#orgheadline12">1.12. 表现股(亦称概念股)</a></li>
<li><a href="#orgheadline13">1.13. 投机性股</a></li>
</ul>
</li>
<li><a href="#orgheadline15">2. strategy</a></li>
<li><a href="#orgheadline32">3. doc</a>
<ul>
<li><a href="#orgheadline16">3.1. 研究标的为期货</a></li>
<li><a href="#orgheadline17">3.2. 研究标的为基金</a></li>
<li><a href="#orgheadline18">3.3. 研究标的为股票</a></li>
<li><a href="#orgheadline19">3.4. 研究方式为技术面</a></li>
<li><a href="#orgheadline20">3.5. 研究方式为基本面</a></li>
<li><a href="#orgheadline21">3.6. 研究方式为机器学习和人工智能</a></li>
<li><a href="#orgheadline22">3.7. 文档语言为英文</a></li>
<li><a href="#orgheadline23">3.8. 文档语言为中文</a></li>
<li><a href="#orgheadline31">3.9. 发布类型为研究报告</a>
<ul>
<li><a href="#orgheadline24">3.9.1. Journal of business strategies</a></li>
<li><a href="#orgheadline25">3.9.2. the account review</a></li>
<li><a href="#orgheadline26">3.9.3. The Journal of Finance</a></li>
<li><a href="#orgheadline27">3.9.4. Quantitative Finance</a></li>
<li><a href="#orgheadline28">3.9.5. Business finance &amp; accounting</a></li>
<li><a href="#orgheadline29">3.9.6. Journal of accounting &amp; economy</a></li>
<li><a href="#orgheadline30">3.9.7. financial management</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline85">4. factor</a>
<ul>
<li><a href="#orgheadline33">4.1. 标的</a></li>
<li><a href="#orgheadline34">4.2. 仓位</a></li>
<li><a href="#orgheadline40">4.3. 公司财务数据</a>
<ul>
<li><a href="#orgheadline39">4.3.1. 基础科目与衍生</a></li>
</ul>
</li>
<li><a href="#orgheadline42">4.4. 最新持仓</a>
<ul>
<li><a href="#orgheadline41">4.4.1. 增减持仓</a></li>
</ul>
</li>
<li><a href="#orgheadline58">4.5. 原始指标</a>
<ul>
<li><a href="#orgheadline43">4.5.1. 指数成分</a></li>
<li><a href="#orgheadline44">4.5.2. 股票所在交易所板块</a></li>
<li><a href="#orgheadline45">4.5.3. 上市及限售</a></li>
<li><a href="#orgheadline50">4.5.4. 公司股东与股本</a></li>
<li><a href="#orgheadline51">4.5.5. 股票行情</a></li>
<li><a href="#orgheadline54">4.5.6. 盈利预测</a></li>
<li><a href="#orgheadline57">4.5.7. 行业划分</a></li>
</ul>
</li>
<li><a href="#orgheadline60">4.6. 行为</a>
<ul>
<li><a href="#orgheadline59">4.6.1. 预测</a></li>
</ul>
</li>
<li><a href="#orgheadline80">4.7. 衍生指标</a>
<ul>
<li><a href="#orgheadline71">4.7.1. 技术面</a></li>
<li><a href="#orgheadline79">4.7.2. 基本面</a></li>
</ul>
</li>
<li><a href="#orgheadline84">4.8. 持仓权重</a>
<ul>
<li><a href="#orgheadline81">4.8.1. portfolio value</a></li>
<li><a href="#orgheadline82">4.8.2. portfolio weight</a></li>
<li><a href="#orgheadline83">4.8.3. portfolio share</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline167">5. f def</a>
<ul>
<li><a href="#orgheadline90">5.1. <span class="todo TODO">TODO</span> 内置类型</a>
<ul>
<li><a href="#orgheadline86">5.1.1. 数组处理</a></li>
<li><a href="#orgheadline87">5.1.2. 添加数据</a></li>
<li><a href="#orgheadline88">5.1.3. 提取数据</a></li>
<li><a href="#orgheadline89">5.1.4. 重命名</a></li>
</ul>
</li>
<li><a href="#orgheadline93">5.2. <span class="todo TODO">TODO</span> 交易相关</a>
<ul>
<li><a href="#orgheadline92">5.2.1. <span class="todo TODO">TODO</span> 模拟交易及绩效</a></li>
</ul>
</li>
<li><a href="#orgheadline98">5.3. <span class="todo TODO">TODO</span> 数据类型</a>
<ul>
<li><a href="#orgheadline94">5.3.1. <span class="todo TODO">TODO</span> 日期时间</a></li>
<li><a href="#orgheadline95">5.3.2. <span class="todo TODO">TODO</span> 数组</a></li>
<li><a href="#orgheadline96">5.3.3. <span class="todo TODO">TODO</span> 类型</a></li>
<li><a href="#orgheadline97">5.3.4. 打印</a></li>
</ul>
</li>
<li><a href="#orgheadline119">5.4. 算术和数学模型</a>
<ul>
<li><a href="#orgheadline99">5.4.1. <span class="todo TODO">TODO</span> 数字</a></li>
<li><a href="#orgheadline102">5.4.2. <span class="todo TODO">TODO</span> 数学</a></li>
<li><a href="#orgheadline105">5.4.3. <span class="todo TODO">TODO</span> 统计</a></li>
<li><a href="#orgheadline109">5.4.4. <span class="todo TODO">TODO</span> 金融</a></li>
<li><a href="#orgheadline118">5.4.5. <span class="todo TODO">TODO</span> 机器学习</a></li>
</ul>
</li>
<li><a href="#orgheadline126">5.5. 策略管理</a>
<ul>
<li><a href="#orgheadline120">5.5.1. <span class="todo TODO">TODO</span> 组合优化</a></li>
<li><a href="#orgheadline121">5.5.2. <span class="todo TODO">TODO</span> 基金策略</a></li>
<li><a href="#orgheadline122">5.5.3. <span class="todo TODO">TODO</span> 基金经理评估</a></li>
<li><a href="#orgheadline123">5.5.4. <span class="todo TODO">TODO</span> 资产配置模型</a></li>
<li><a href="#orgheadline124">5.5.5. <span class="todo TODO">TODO</span> 策略函数</a></li>
<li><a href="#orgheadline125">5.5.6. <span class="todo TODO">TODO</span> 策略分析</a></li>
</ul>
</li>
<li><a href="#orgheadline132">5.6. 数据分析</a>
<ul>
<li><a href="#orgheadline127">5.6.1. <span class="todo TODO">TODO</span> 组合因子业绩贡献</a></li>
<li><a href="#orgheadline128">5.6.2. <span class="todo TODO">TODO</span> 业绩归因</a></li>
<li><a href="#orgheadline129">5.6.3. <span class="todo TODO">TODO</span> 绩效归因</a></li>
<li><a href="#orgheadline130">5.6.4. <span class="todo TODO">TODO</span> 持仓分析</a></li>
<li><a href="#orgheadline131">5.6.5. <span class="todo TODO">TODO</span> 因子收益率查看函数</a></li>
</ul>
</li>
<li><a href="#orgheadline135">5.7. 数据格式</a>
<ul>
<li><a href="#orgheadline133">5.7.1. <span class="todo TODO">TODO</span> 转换数据类型</a></li>
<li><a href="#orgheadline134">5.7.2. <span class="todo TODO">TODO</span> OOTV</a></li>
</ul>
</li>
<li><a href="#orgheadline146">5.8. 数据处理</a>
<ul>
<li><a href="#orgheadline141">5.8.1. <span class="todo TODO">TODO</span> 信号处理</a></li>
<li><a href="#orgheadline142">5.8.2. <span class="todo TODO">TODO</span> 行业中性</a></li>
<li><a href="#orgheadline143">5.8.3. <span class="todo TODO">TODO</span> 因子加权</a></li>
<li><a href="#orgheadline144">5.8.4. <span class="todo TODO">TODO</span> 升维</a></li>
<li><a href="#orgheadline145">5.8.5. <span class="todo TODO">TODO</span> 面板数据处理</a></li>
</ul>
</li>
<li><a href="#orgheadline151">5.9. 通用操作系统服务</a>
<ul>
<li><a href="#orgheadline147">5.9.1. 系统</a></li>
<li><a href="#orgheadline149">5.9.2. 时间</a></li>
<li><a href="#orgheadline150">5.9.3. 日志</a></li>
</ul>
</li>
<li><a href="#orgheadline153">5.10. 金融数据处理</a>
<ul>
<li><a href="#orgheadline152">5.10.1. 财务相关</a></li>
</ul>
</li>
<li><a href="#orgheadline155">5.11. <span class="todo TODO">TODO</span> 结构化标记处理工具</a>
<ul>
<li><a href="#orgheadline154">5.11.1. <span class="todo TODO">TODO</span> 时间序列</a></li>
</ul>
</li>
<li><a href="#orgheadline157">5.12. 开发工具</a>
<ul>
<li><a href="#orgheadline156">5.12.1. <span class="todo TODO">TODO</span> 编程接口</a></li>
</ul>
</li>
<li><a href="#orgheadline162">5.13. 衍生模块</a>
<ul>
<li><a href="#orgheadline158">5.13.1. 指数相关</a></li>
<li><a href="#orgheadline159">5.13.2. 事件相关</a></li>
<li><a href="#orgheadline160">5.13.3. 财务相关</a></li>
<li><a href="#orgheadline161">5.13.4. 持仓相关</a></li>
</ul>
</li>
<li><a href="#orgheadline166">5.14. 杂项服务</a>
<ul>
<li><a href="#orgheadline163">5.14.1. 其它</a></li>
<li><a href="#orgheadline164">5.14.2. <span class="todo TODO">TODO</span> 期货相关</a></li>
<li><a href="#orgheadline165">5.14.3. FR相关</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline168">6. fs def</a></li>
<li><a href="#orgheadline169">7. fs inst</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">1</span> stock</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> 普通股</h3>
<div class="outline-text-3" id="text-1-1">
<p>
是指在公司的经营管理和盈利及财产的分配上享有普通权利的股份，代表满足所有债权偿付要求及优先股东的收益权与求偿权要求后对企业盈利和剩余财产的索取权。
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> 优先股</h3>
<div class="outline-text-3" id="text-1-2">
<p>
优先股在利润分红及剩余财产分配的权利方面优先于普通股。
</p>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> 后配股</h3>
<div class="outline-text-3" id="text-1-3">
<p>
是在利益或利息分红及剩余财产分配时比普通股处于劣势的股票，一般是在普通股分配之后，对剩余利益进行再分配。
</p>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.4</span> 垃圾股</h3>
<div class="outline-text-3" id="text-1-4">
<p>
经营亏损或违规的公司的股票。
</p>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.5</span> 绩优股</h3>
<div class="outline-text-3" id="text-1-5">
<p>
公司经营很好，业绩很好，每股收益0.8元以上.市盈率10-15倍以内.指那些业绩优良，但增长速度较慢的公司的股票。这类公司有实力抵抗经济衰退，但这类公司并不能给你带来振奋人心的利润。
</p>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">1.6</span> 蓝筹股</h3>
<div class="outline-text-3" id="text-1-6">
<p>
那些在其所属行业内占有重要支配性地位、业绩优良，成交活跃、红利优厚的大公司股票称为蓝筹股。
</p>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">1.7</span> 成长股</h3>
<div class="outline-text-3" id="text-1-7">
<p>
是指发行股票时规模并不大，但公司的业务蒸蒸日上，管理良好，利润丰厚，产品在市场上有竞争力的公司的股票。
</p>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">1.8</span> 热门股</h3>
<div class="outline-text-3" id="text-1-8">
<p>
是指交易量大、交易周转率高、股价涨跌幅度也较大的股票。热门股的形成往往有其特定的经济、政治、社会等原因。
</p>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">1.9</span> 周期股</h3>
<div class="outline-text-3" id="text-1-9">
<p>
是指经营业绩随着经济周期的涨缩而变动的公司的股票。航空工业、汽车工业、钢铁及化学工业都属于此类。
</p>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">1.10</span> 再生股</h3>
<div class="outline-text-3" id="text-1-10">
<p>
是指经营发生困难甚至破产，经过整顿后重新获得投资者认可的企业股票。
</p>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">1.11</span> 防守性股</h3>
<div class="outline-text-3" id="text-1-11">
<p>
这些普通股股票同股价循环股正好相反，它们在面临不确定性和商业衰退时收益和红利却要比社会平均的高，具有相对的稳定性。
</p>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">1.12</span> 表现股(亦称概念股)</h3>
<div class="outline-text-3" id="text-1-12">
<p>
是指能迎合某一时代潮流但未必能适应另一时代潮流的公司所发行的，股价呈巨幅起伏的股票。
</p>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">1.13</span> 投机性股</h3>
<div class="outline-text-3" id="text-1-13">
<p>
是指那些价格很不稳定或公司前景很不确定的普通股。这主要是那些雄心很大，开发性或冒险性的公司的股票，热门的新发行股以及一些面值较低的石油与矿业公司发行的普通股票。
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-2">
<h2 id="orgheadline15"><span class="section-number-2">2</span> strategy</h2>
</div>

<div id="outline-container-orgheadline32" class="outline-2">
<h2 id="orgheadline32"><span class="section-number-2">3</span> doc</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">3.1</span> 研究标的为期货</h3>
</div>
<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">3.2</span> 研究标的为基金</h3>
</div>
<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">3.3</span> 研究标的为股票</h3>
</div>
<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="section-number-3">3.4</span> 研究方式为技术面</h3>
</div>
<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="section-number-3">3.5</span> 研究方式为基本面</h3>
</div>
<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21"><span class="section-number-3">3.6</span> 研究方式为机器学习和人工智能</h3>
</div>
<div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22"><span class="section-number-3">3.7</span> 文档语言为英文</h3>
</div>
<div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23"><span class="section-number-3">3.8</span> 文档语言为中文</h3>
</div>
<div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31"><span class="section-number-3">3.9</span> 发布类型为研究报告</h3>
<div class="outline-text-3" id="text-3-9">
</div><div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24"><span class="section-number-4">3.9.1</span> Journal of business strategies</h4>
</div>
<div id="outline-container-orgheadline25" class="outline-4">
<h4 id="orgheadline25"><span class="section-number-4">3.9.2</span> the account review</h4>
</div>
<div id="outline-container-orgheadline26" class="outline-4">
<h4 id="orgheadline26"><span class="section-number-4">3.9.3</span> The Journal of Finance</h4>
</div>
<div id="outline-container-orgheadline27" class="outline-4">
<h4 id="orgheadline27"><span class="section-number-4">3.9.4</span> Quantitative Finance</h4>
</div>
