docs/GS/OSet/oset.html
<div id="outline-container-orgheadline28" class="outline-4">
<h4 id="orgheadline28"><span class="section-number-4">3.9.5</span> Business finance &amp; accounting</h4>
</div>
<div id="outline-container-orgheadline29" class="outline-4">
<h4 id="orgheadline29"><span class="section-number-4">3.9.6</span> Journal of accounting &amp; economy</h4>
</div>
<div id="outline-container-orgheadline30" class="outline-4">
<h4 id="orgheadline30"><span class="section-number-4">3.9.7</span> financial management</h4>
<div class="outline-text-4" id="text-3-9-7">
<p>
&#x2026;
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline85" class="outline-2">
<h2 id="orgheadline85"><span class="section-number-2">4</span> factor</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline33" class="outline-3">
<h3 id="orgheadline33"><span class="section-number-3">4.1</span> 标的</h3>
</div>
<div id="outline-container-orgheadline34" class="outline-3">
<h3 id="orgheadline34"><span class="section-number-3">4.2</span> 仓位</h3>
</div>
<div id="outline-container-orgheadline40" class="outline-3">
<h3 id="orgheadline40"><span class="section-number-3">4.3</span> 公司财务数据</h3>
<div class="outline-text-3" id="text-4-3">
</div><div id="outline-container-orgheadline39" class="outline-4">
<h4 id="orgheadline39"><span class="section-number-4">4.3.1</span> 基础科目与衍生</h4>
<div class="outline-text-4" id="text-4-3-1">
</div><ol class="org-ol"><li><a id="orgheadline35"></a>主要会计数据<br  /></li>
<li><a id="orgheadline36"></a>现金流量表<br  /></li>
<li><a id="orgheadline37"></a>资产负债表<br  /></li>
<li><a id="orgheadline38"></a>利润表<br  /></li></ol>
</div>
</div>
<div id="outline-container-orgheadline42" class="outline-3">
<h3 id="orgheadline42"><span class="section-number-3">4.4</span> 最新持仓</h3>
<div class="outline-text-3" id="text-4-4">
<p>
大股东持仓，机构持仓。
</p>
</div>
<div id="outline-container-orgheadline41" class="outline-4">
<h4 id="orgheadline41"><span class="section-number-4">4.4.1</span> 增减持仓</h4>
</div>
</div>

<div id="outline-container-orgheadline58" class="outline-3">
<h3 id="orgheadline58"><span class="section-number-3">4.5</span> 原始指标</h3>
<div class="outline-text-3" id="text-4-5">
</div><div id="outline-container-orgheadline43" class="outline-4">
<h4 id="orgheadline43"><span class="section-number-4">4.5.1</span> 指数成分</h4>
</div>
<div id="outline-container-orgheadline44" class="outline-4">
<h4 id="orgheadline44"><span class="section-number-4">4.5.2</span> 股票所在交易所板块</h4>
</div>
<div id="outline-container-orgheadline45" class="outline-4">
<h4 id="orgheadline45"><span class="section-number-4">4.5.3</span> 上市及限售</h4>
</div>
<div id="outline-container-orgheadline50" class="outline-4">
<h4 id="orgheadline50"><span class="section-number-4">4.5.4</span> 公司股东与股本</h4>
<div class="outline-text-4" id="text-4-5-4">
</div><ol class="org-ol"><li><a id="orgheadline46"></a>股东股权变动<br  /></li>
<li><a id="orgheadline47"></a>股权分置<br  /></li>
<li><a id="orgheadline48"></a>股东户数<br  /></li>
<li><a id="orgheadline49"></a>人员持有股份变动情况<br  /></li></ol>
</div>
<div id="outline-container-orgheadline51" class="outline-4">
<h4 id="orgheadline51"><span class="section-number-4">4.5.5</span> 股票行情</h4>
</div>
<div id="outline-container-orgheadline54" class="outline-4">
<h4 id="orgheadline54"><span class="section-number-4">4.5.6</span> 盈利预测</h4>
<div class="outline-text-4" id="text-4-5-6">
</div><ol class="org-ol"><li><a id="orgheadline52"></a>分析师预测<br  /></li>
<li><a id="orgheadline53"></a>股票评级<br  /></li></ol>
</div>
<div id="outline-container-orgheadline57" class="outline-4">
<h4 id="orgheadline57"><span class="section-number-4">4.5.7</span> 行业划分</h4>
<div class="outline-text-4" id="text-4-5-7">
</div><ol class="org-ol"><li><a id="orgheadline55"></a>中信一级行业<br  /></li>
<li><a id="orgheadline56"></a>中信三级行业<br  /></li></ol>
</div>
</div>
<div id="outline-container-orgheadline60" class="outline-3">
<h3 id="orgheadline60"><span class="section-number-3">4.6</span> 行为</h3>
<div class="outline-text-3" id="text-4-6">
</div><div id="outline-container-orgheadline59" class="outline-4">
<h4 id="orgheadline59"><span class="section-number-4">4.6.1</span> 预测</h4>
</div>
</div>
<div id="outline-container-orgheadline80" class="outline-3">
<h3 id="orgheadline80"><span class="section-number-3">4.7</span> 衍生指标</h3>
<div class="outline-text-3" id="text-4-7">
</div><div id="outline-container-orgheadline71" class="outline-4">
<h4 id="orgheadline71"><span class="section-number-4">4.7.1</span> 技术面</h4>
<div class="outline-text-4" id="text-4-7-1">
</div><ol class="org-ol"><li><a id="orgheadline61"></a>行情<br  /></li>
<li><a id="orgheadline62"></a>压力支撑<br  /></li>
<li><a id="orgheadline63"></a>趋向<br  /></li>
<li><a id="orgheadline64"></a>波动<br  /></li>
<li><a id="orgheadline65"></a>反趋向<br  /></li>
<li><a id="orgheadline66"></a>能量<br  /></li>
<li><a id="orgheadline67"></a>成交量<br  /></li>
<li><a id="orgheadline68"></a>动量<br  /></li>
<li><a id="orgheadline69"></a>规模<br  /></li>
<li><a id="orgheadline70"></a>金融工程<br  /></li></ol>
</div>
<div id="outline-container-orgheadline79" class="outline-4">
<h4 id="orgheadline79"><span class="section-number-4">4.7.2</span> 基本面</h4>
<div class="outline-text-4" id="text-4-7-2">
</div><ol class="org-ol"><li><a id="orgheadline72"></a>偿债能力资本结构<br  /></li>
<li><a id="orgheadline73"></a>营运能力<br  /></li>
<li><a id="orgheadline74"></a>成长<br  /></li>
<li><a id="orgheadline75"></a>现金流<br  /></li>
<li><a id="orgheadline76"></a>盈利能力收益质量<br  /></li>
<li><a id="orgheadline77"></a>每股指标<br  /></li>
<li><a id="orgheadline78"></a>价值<br  /></li></ol>
</div>
</div>
<div id="outline-container-orgheadline84" class="outline-3">
<h3 id="orgheadline84"><span class="section-number-3">4.8</span> 持仓权重</h3>
<div class="outline-text-3" id="text-4-8">
</div><div id="outline-container-orgheadline81" class="outline-4">
<h4 id="orgheadline81"><span class="section-number-4">4.8.1</span> portfolio value</h4>
</div>

<div id="outline-container-orgheadline82" class="outline-4">
<h4 id="orgheadline82"><span class="section-number-4">4.8.2</span> portfolio weight</h4>
<div class="outline-text-4" id="text-4-8-2">
<p>
used for multi-factor analysis
</p>
</div>
</div>
<div id="outline-container-orgheadline83" class="outline-4">
<h4 id="orgheadline83"><span class="section-number-4">4.8.3</span> portfolio share</h4>
</div>
</div>
</div>
<div id="outline-container-orgheadline167" class="outline-2">
<h2 id="orgheadline167"><span class="section-number-2">5</span> f def</h2>
<div class="outline-text-2" id="text-5">
<p>
libraries classification source:
</p>

<p>
<a href="http://usyiyi.cn/translate/python_352/library/index.html">Python Simple Chinese</a>
</p>

<p>
<a href="https://docs.python.org/3/library/index.html">Python English</a>
</p>

<p>
<a href="https://en.wikipedia.org/wiki/C_standard_library">C<sub>standard</sub><sub>library</sub></a>
</p>

<p>
<a href="http://en.cppreference.com/w/c/links/libs">C++</a>
</p>

<p>
<a href="https://zh.wikipedia.org/wiki/%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0">Machine Learning</a>
</p>

<p>
<a href="https://en.wikipedia.org/wiki/Outline_of_machine_learning">Outline of machine learning</a>
</p>
</div>

<div id="outline-container-orgheadline90" class="outline-3">
<h3 id="orgheadline90"><span class="section-number-3">5.1</span> <span class="todo TODO">TODO</span> 内置类型</h3>
<div class="outline-text-3" id="text-5-1">
</div><div id="outline-container-orgheadline86" class="outline-4">
<h4 id="orgheadline86"><span class="section-number-4">5.1.1</span> 数组处理</h4>
</div>
<div id="outline-container-orgheadline87" class="outline-4">
<h4 id="orgheadline87"><span class="section-number-4">5.1.2</span> 添加数据</h4>
</div>
<div id="outline-container-orgheadline88" class="outline-4">
<h4 id="orgheadline88"><span class="section-number-4">5.1.3</span> 提取数据</h4>
</div>
<div id="outline-container-orgheadline89" class="outline-4">
<h4 id="orgheadline89"><span class="section-number-4">5.1.4</span> 重命名</h4>
</div>
</div>
<div id="outline-container-orgheadline93" class="outline-3">
<h3 id="orgheadline93"><span class="section-number-3">5.2</span> <span class="todo TODO">TODO</span> 交易相关</h3>
<div class="outline-text-3" id="text-5-2">
</div><div id="outline-container-orgheadline92" class="outline-4">
<h4 id="orgheadline92"><span class="section-number-4">5.2.1</span> <span class="todo TODO">TODO</span> 模拟交易及绩效</h4>
<div class="outline-text-4" id="text-5-2-1">
</div><ol class="org-ol"><li><a id="orgheadline91"></a>期货<br  /></li></ol>
</div>
</div>

<div id="outline-container-orgheadline98" class="outline-3">
<h3 id="orgheadline98"><span class="section-number-3">5.3</span> <span class="todo TODO">TODO</span> 数据类型</h3>
<div class="outline-text-3" id="text-5-3">
</div><div id="outline-container-orgheadline94" class="outline-4">
<h4 id="orgheadline94"><span class="section-number-4">5.3.1</span> <span class="todo TODO">TODO</span> 日期时间</h4>
</div>

<div id="outline-container-orgheadline95" class="outline-4">
<h4 id="orgheadline95"><span class="section-number-4">5.3.2</span> <span class="todo TODO">TODO</span> 数组</h4>
</div>

<div id="outline-container-orgheadline96" class="outline-4">
<h4 id="orgheadline96"><span class="section-number-4">5.3.3</span> <span class="todo TODO">TODO</span> 类型</h4>
</div>

<div id="outline-container-orgheadline97" class="outline-4">
<h4 id="orgheadline97"><span class="section-number-4">5.3.4</span> 打印</h4>
</div>
</div>

<div id="outline-container-orgheadline119" class="outline-3">
<h3 id="orgheadline119"><span class="section-number-3">5.4</span> 算术和数学模型</h3>
<div class="outline-text-3" id="text-5-4">
</div><div id="outline-container-orgheadline99" class="outline-4">
<h4 id="orgheadline99"><span class="section-number-4">5.4.1</span> <span class="todo TODO">TODO</span> 数字</h4>
</div>

<div id="outline-container-orgheadline102" class="outline-4">
<h4 id="orgheadline102"><span class="section-number-4">5.4.2</span> <span class="todo TODO">TODO</span> 数学</h4>
<div class="outline-text-4" id="text-5-4-2">
</div><ol class="org-ol"><li><a id="orgheadline100"></a><span class="todo TODO">TODO</span> 简单运算<br  /></li>
<li><a id="orgheadline101"></a><span class="todo TODO">TODO</span> 多列计算<br  /></li></ol>
</div>
<div id="outline-container-orgheadline105" class="outline-4">
<h4 id="orgheadline105"><span class="section-number-4">5.4.3</span> <span class="todo TODO">TODO</span> 统计</h4>
<div class="outline-text-4" id="text-5-4-3">
</div><ol class="org-ol"><li><a id="orgheadline103"></a><span class="todo TODO">TODO</span> 横截面聚合<br  /></li>
<li><a id="orgheadline104"></a><span class="todo TODO">TODO</span> 统计分析<br  /></li></ol>
</div>
<div id="outline-container-orgheadline109" class="outline-4">
<h4 id="orgheadline109"><span class="section-number-4">5.4.4</span> <span class="todo TODO">TODO</span> 金融</h4>
<div class="outline-text-4" id="text-5-4-4">
</div><ol class="org-ol"><li><a id="orgheadline107"></a><span class="todo TODO">TODO</span> ta-lib<br  /><ol class="org-ol"><li><a id="orgheadline106"></a><span class="todo TODO">TODO</span> 技术指标<br  /></li></ol></li>
<li><a id="orgheadline108"></a><span class="todo TODO">TODO</span> RiskModel<br  /></li></ol>
</div>

<div id="outline-container-orgheadline118" class="outline-4">
<h4 id="orgheadline118"><span class="section-number-4">5.4.5</span> <span class="todo TODO">TODO</span> 机器学习</h4>
<div class="outline-text-4" id="text-5-4-5">
</div><ol class="org-ol"><li><a id="orgheadline110"></a>问题<br  /><div class="outline-text-5" id="text-5-4-5-1">
<ul class="org-ul">
<li>分类</li>
<li>聚类</li>
<li>回归
<ul class="org-ul">
<li>模型</li>
</ul></li>
</ul>
<p>
线性回归 简单回归 普通最小二乘法 多项式回归 一般线性模型
</p>

<p>
广义线性模式 离散选择 逻辑回归 多项罗吉特 混合罗吉特 波比 多项式波比 排序性模型 有序波比 泊松回归
</p>

<p>
等级线性模型 固定效应 随机效应 混合模型
</p>

<p>
非线性回归 非参数 半参数 稳健 分位数回归 保序回归 主成分 最小角 局部 分段
含误差变量
</p>

<ul class="org-ul">
<li>估计</li>
</ul>

<p>
最小二乘法 普通最小二乘法 线性 偏最小二乘回归 总体 广义 加权 非线性 非负 重复再加权 岭回归 LASSO
</p>

<p>
最小绝对值导数法 贝叶斯 贝叶斯多元
</p>
<ul class="org-ul">
<li>背景</li>
</ul>
<p>
回归模型检验 平均响应和预测响应 误差和残差 拟合优度 学生化残差 高斯－马尔可夫定理
</p>
<ul class="org-ul">
<li>异常检测</li>
</ul>
<p>
关联规则 强化学习 结构预测 特征学习 在线学习 半监督学习 语法归纳
</p>
</div></li>
<li><a id="orgheadline111"></a><span class="todo TODO">TODO</span> 监督学习(分类 · 回归)<br  /><div class="outline-text-5" id="text-5-4-5-2">
<ul class="org-ul">
<li>决策树</li>
<li>表征（装袋, 提升，随机森林）</li>
<li>k-NN</li>
<li>线性回归</li>
<li>朴素贝叶斯</li>
<li>神经网络</li>
</ul>
<p>
<a href="http://www.hankcs.com/ml/understanding-the-convolution-in-deep-learning.html">http://www.hankcs.com/ml/understanding-the-convolution-in-deep-learning.html</a>
</p>
<ul class="org-ul">
<li>逻辑回归</li>
<li>感知器</li>
<li>支持向量机（SVM）</li>
<li>相关向量机（RVM）</li>
</ul>
</div></li>
<li><a id="orgheadline112"></a><span class="todo TODO">TODO</span> 聚类<br  /><div class="outline-text-5" id="text-5-4-5-3">
<ul class="org-ul">
<li>BIRCH</li>
<li>层次</li>
<li>k平均</li>
<li>期望最大化（EM）</li>
<li>DBSCAN</li>
<li>OPTICS</li>
<li>均值飘移</li>
</ul>
</div></li>
<li><a id="orgheadline113"></a><span class="todo TODO">TODO</span> 降维<br  /><div class="outline-text-5" id="text-5-4-5-4">
<ul class="org-ul">
<li>因子分析</li>
<li>CCA</li>
<li>ICA</li>
<li>LDA</li>
<li>NMF</li>
<li>PCA</li>
<li>LASSO</li>
<li>t-SNE</li>
</ul>
</div></li>
<li><a id="orgheadline114"></a><span class="todo TODO">TODO</span> 结构预测<br  /><div class="outline-text-5" id="text-5-4-5-5">
<ul class="org-ul">
<li>概率图模型（贝叶斯网络，CRF, HMM）</li>
</ul>
</div></li>
